In [ ]:
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy.engine.reflection import Inspector

In [ ]:
engine = create_engine("mysql+pymysql://alex123:alex123@127.0.0.1:3306/alex123")

In [15]:
inspector = Inspector.from_engine(engine)
table_names = inspector.get_table_names()
table_names

/tmp/ipykernel_98996/530473195.py:1: SADeprecationWarning: The from_engine() method on Inspector is deprecated and will be removed in a future release.  Please use the sqlalchemy.inspect() function on an Engine or Connection in order to acquire an Inspector. (deprecated since: 1.4)
  inspector = Inspector.from_engine(engine)

['adduct',
 'fragment',
 'lipid_category',
 'lipid_class',
 'molecular_lipid_species',
 'sum_lipid_species']

In [ ]:
for table_name in table_names:
	print(table_name)
	display(pd.read_sql_table(table_name=table_name, con=engine).head())

adduct

   adduct_id adduct_name  adduct_mass  adduct_charge
0          1         +H+     1.007276              1
1          2        +2H+     2.014553              2
2          3        +Na+    22.989219              1
3          4       +NH4+    18.033826              1
4          5     +[39]K+    38.963158              1

lipid_category

   lipid_category_id  lipid_category_name
0                  1           Fatty acyl
1                  2  Glycerophospholipid
2                  3         Sterol lipid
3                  4         Glycerolipid
4                  5         Sphingolipid

lipid_class

   lipid_class_id lipid_class_name  lipid_category_id
0               1             ACar                  1
1               2              LPA                  2
2               3           LPE O-                  2
3               4              LPE                  2
4               5            LMMPE                  2

sum_lipid_species

,sum_lipid_species_id,sum_lipid_species_name,sum_lipid_species_mass,lipid_class_id
0,1,ACar 3:1,215.115758,1
1,2,ACar 4:2,227.115758,1
2,3,ACar 4:1,229.131408,1
3,4,ACar 5:3,239.115758,1
4,5,ACar 5:2,241.131408,1

molecular_lipid_species

,molecular_lipid_species_id,molecular_lipid_species_name,sum_lipid_species_id
0,1,ACar 3:1,1
1,2,ACar 4:2,2
2,3,ACar 4:1,3
3,4,ACar 5:3,4
4,5,ACar 5:2,5

fragment

,fragment_id,fragment_name,fragment_mass,fragment_sum_formula,fragment_polarity,adduct_id,molecular_lipid_species_id
0,1,FA 3:1,55.017841,C3H3O,1,1,1
1,2,FA 3:1(+C4H6O3),157.049535,C7H9O4,1,1,1
2,3,-FA 3:1(+HO),144.101905,C7H14NO2,1,1,1
3,4,FA 4:2,67.017841,C4H3O,1,1,2
4,5,FA 4:2(+C4H6O3),169.049535,C8H9O4,1,1,2